In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.DataFrame([1,2,3,4,58])
data.head()

    0
0   1
1   2
2   3
3   4
4  58

In [3]:
data.describe()

               0
count   5.000000
mean   13.600000
std    24.845523
min     1.000000
25%     2.000000
50%     3.000000
75%     4.000000
max    58.000000

In [4]:
financial_data={
    'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'sales':[200,120,340,124,243,350],
    'profit':[20,12,34,12,24,35]
}
data=pd.DataFrame(financial_data)
data.head()

  company   person  sales  profit
0    GOOG      Sam    200      20
1    GOOG  Charlie    120      12
2    MSFT      Amy    340      34
3    MSFT  Vanessa    124      12
4      FB     Carl    243      24

In [5]:
data.describe()

            sales     profit
count    6.000000   6.000000
mean   229.500000  22.833333
std    100.899455  10.166940
min    120.000000  12.000000
25%    143.000000  14.000000
50%    221.500000  22.000000
75%    315.750000  31.500000
max    350.000000  35.000000

In [15]:
mean=data.iloc[:,3].mean()

In [16]:
std=data.iloc[:,3].std()

In [17]:
data['profit']

0    20
1    12
2    34
3    12
4    24
5    35
Name: profit, dtype: int64

In [25]:
data.loc[((data['profit']<=(mean-std)) & (data['profit']<=(mean+std))),:]

  company   person  sales  profit
1    GOOG  Charlie    120      12
3    MSFT  Vanessa    124      12